app/controllers/students_controller.rb

SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @students =  Student.all